function pr8
t=[0 100];
clc;
x = [5; 1];
%for aa=0.1:0.1:1
%for e=0.1:0.1:1
for y=0.1:0.1:0.8
%for b=0.1:0.1:1
%for a=0.1:0.1:10
    [t,X]=ode45(@(t, x) Func(t,y,x),t, x);
    %plot(t,X(:,1),'b-', t,X(:,2),'r-'); legend('Жертвы','Хищники'); %график
    plot(X(:,1), X(:,2)); %фазовый портрет
    hold on;
end
title('«Хищник-жертва» с аддитивным управлением по хищникам');
end

function out=Func(~,y,x)
a = 0.8;
aa = 0.6; %0.8
e = 0.8;
%y = 0.3;
b = 0.055;
%xx = 0.4;
T = 1;
p = 2;

disp (a); 
u = -a.*x(1) + (x(1).*x(2))./(1 + aa.*x(1)) + e.*x(1).*x(1) + p.*(-y.*x(2) + (x(1).*x(2))./(1 + aa.*x(1)) - b.*x(2).*x(2)) - ((x(1)-p.*x(2))/(T)); 
%u = - (x(1) - xx)/T - (a.*x(1)- (x(1).*x(2))./(1 + aa.*x(1)) - e.*x(1).*x(1));

f1 = (a.*x(1)- (x(1).*x(2))./(1 + aa.*x(1)) - e.*x(1).*x(1)+u);
f2 = (-y.*x(2) + (x(1).*x(2))./(1 + aa.*x(1)) - b.*x(2).*x(2));

out = [f1;f2];
end
